In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/credit/clients_clean.csv')

In [3]:
df

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,OCCUPATION_TYPE,CNT_FAM_MEMBERS,years,amt_income_month,renda_per_capita,years_employed,contact,target
0,5169718,F,N,Y,0,State servant,Higher education,Married,House / apartment,NaN,2.0,28,15000.0,7500.00,5.33,1,0
1,5177389,F,N,N,0,Commercial associate,Higher education,Married,House / apartment,NaN,2.0,32,5625.0,2812.50,2.64,1,0
2,5178676,F,Y,Y,0,Working,Higher education,Married,House / apartment,Sales staff,2.0,30,15000.0,7500.00,4.48,1,0
3,5185896,F,Y,Y,0,Commercial associate,Higher education,Widow,House / apartment,NaN,1.0,49,16875.0,16875.00,4.98,1,0
4,5196912,F,N,N,0,Working,Secondary / secondary special,Married,House / apartment,Sales staff,2.0,48,9750.0,4875.00,5.30,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438552,5998538,F,Y,Y,2,Working,Secondary / secondary special,Married,House / apartment,Sales staff,4.0,27,6375.0,1593.75,0.42,1,0
438553,5155788,F,Y,Y,0,Pensioner,Higher education,Married,House / apartment,NaN,2.0,45,37500.0,18750.00,NaN,1,1
438554,5156748,F,N,Y,0,Pensioner,Secondary / secondary special,Married,House / apartment,NaN,2.0,56,9375.0,4687.50,NaN,1,1
438555,5159345,F,N,Y,0,Pensioner,Higher education,Separated,House / apartment,NaN,1.0,63,10125.0,10125.00,NaN,1,1
438556,5164987,M,N,Y,0,Pensioner,Higher education,Married,House / apartment,NaN,2.0,60,13125.0,6562.50,NaN,1,1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 17 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   NAME_INCOME_TYPE     438557 non-null  object
 6   NAME_EDUCATION_TYPE  438557 non-null  object
 7   NAME_FAMILY_STATUS   438557 non-null  object
 8   NAME_HOUSING_TYPE    438557 non-null  object
 9   OCCUPATION_TYPE      304354 non-null  object
 10  CNT_FAM_MEMBERS      438557 non-null  float64
 11  years                438557 non-null  int64
 12  amt_income_month     438557 non-null  float64
 13  renda_per_capita     438557 non-null  float64
 14  years_employed       363228 non-null  float64
 15  contact              438557 non-null  int64
 16  target               438557 non-null  int64
dtypes: float64(4), int64(5), object(8)
memory usage: 56.9+ MB

In [5]:
#-- IGNORE CODE --#
#df['CODE_GENDER'].value_counts()
#df['FLAG_OWN_CAR'].value_counts()
#df['FLAG_OWN_REALTY'].value_counts()

In [6]:
df['CODE_GENDER'] = df['CODE_GENDER'].map({'M': 0, 'F': 1})
df['FLAG_OWN_CAR'] = df['FLAG_OWN_CAR'].map({'N': 0, 'Y': 1})
df['FLAG_OWN_REALTY'] = df['FLAG_OWN_REALTY'].map({'N': 0, 'Y': 1})

In [7]:
df

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,OCCUPATION_TYPE,CNT_FAM_MEMBERS,years,amt_income_month,renda_per_capita,years_employed,contact,target
0,5169718,1,0,1,0,State servant,Higher education,Married,House / apartment,NaN,2.0,28,15000.0,7500.00,5.33,1,0
1,5177389,1,0,0,0,Commercial associate,Higher education,Married,House / apartment,NaN,2.0,32,5625.0,2812.50,2.64,1,0
2,5178676,1,1,1,0,Working,Higher education,Married,House / apartment,Sales staff,2.0,30,15000.0,7500.00,4.48,1,0
3,5185896,1,1,1,0,Commercial associate,Higher education,Widow,House / apartment,NaN,1.0,49,16875.0,16875.00,4.98,1,0
4,5196912,1,0,0,0,Working,Secondary / secondary special,Married,House / apartment,Sales staff,2.0,48,9750.0,4875.00,5.30,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438552,5998538,1,1,1,2,Working,Secondary / secondary special,Married,House / apartment,Sales staff,4.0,27,6375.0,1593.75,0.42,1,0
438553,5155788,1,1,1,0,Pensioner,Higher education,Married,House / apartment,NaN,2.0,45,37500.0,18750.00,NaN,1,1
438554,5156748,1,0,1,0,Pensioner,Secondary / secondary special,Married,House / apartment,NaN,2.0,56,9375.0,4687.50,NaN,1,1
438555,5159345,1,0,1,0,Pensioner,Higher education,Separated,House / apartment,NaN,1.0,63,10125.0,10125.00,NaN,1,1
438556,5164987,0,0,1,0,Pensioner,Higher education,Married,House / apartment,NaN,2.0,60,13125.0,6562.50,NaN,1,1

In [8]:
#Limpeza dos dados nans nas colunas [OCCUPATION_TYPE, years_employed]
df['OCCUPATION_TYPE'] = df['OCCUPATION_TYPE'].fillna('Missing')
df['years_employed'] = df['years_employed'].fillna(0)

In [9]:
#Transformando colunas categóricas em tipo category para entendimento do modelo sem one-hot encoding
cat_cols = [
    "NAME_INCOME_TYPE",
    "NAME_EDUCATION_TYPE",
    "NAME_FAMILY_STATUS",
    "NAME_HOUSING_TYPE",
    "OCCUPATION_TYPE",
]
for col in cat_cols:
    df[col] = df[col].astype('category')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 17 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  int64
 2   FLAG_OWN_CAR         438557 non-null  int64
 3   FLAG_OWN_REALTY      438557 non-null  int64
 4   CNT_CHILDREN         438557 non-null  int64
 5   NAME_INCOME_TYPE     438557 non-null  category
 6   NAME_EDUCATION_TYPE  438557 non-null  category
 7   NAME_FAMILY_STATUS   438557 non-null  category
 8   NAME_HOUSING_TYPE    438557 non-null  category
 9   OCCUPATION_TYPE      438557 non-null  category
 10  CNT_FAM_MEMBERS      438557 non-null  float64
 11  years                438557 non-null  int64
 12  amt_income_month     438557 non-null  float64
 13  renda_per_capita     438557 non-null  float64
 14  years_employed       438557 non-null  float64
 15  contact              438557 non-null  int64
 16  target               438557 non-null  int64
dtypes: category(5), float64(4), int64(8)
memory usage: 42.2 MB

In [11]:
df.describe()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,CNT_FAM_MEMBERS,years,amt_income_month,renda_per_capita,years_employed,contact,target
count,4.385570e+05,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.0,438557.000000
mean,6.022176e+06,0.671384,0.371897,0.693351,0.427390,2.194465,43.295569,15627.023840,8451.433350,5.947989,1.0,0.254642
std,5.716370e+05,0.469711,0.483312,0.461103,0.724882,0.897207,11.459525,9173.904423,6405.192441,6.563699,0.0,0.435660
min,5.008804e+06,0.000000,0.000000,0.000000,0.000000,1.000000,20.000000,2175.000000,468.750000,0.000000,1.0,0.000000
25%,5.609375e+06,0.000000,0.000000,0.000000,0.000000,2.000000,34.000000,10125.000000,4687.500000,1.020000,1.0,0.000000
50%,6.047745e+06,1.000000,0.000000,1.000000,0.000000,2.000000,42.000000,13398.380000,6562.500000,4.020000,1.0,0.000000
75%,6.456971e+06,1.000000,1.000000,1.000000,1.000000,3.000000,53.000000,18750.000000,10312.500000,8.500000,1.0,1.000000
max,7.999952e+06,1.000000,1.000000,1.000000,19.000000,20.000000,68.000000,562500.000000,281250.000000,48.000000,1.0,1.000000

In [12]:
#df['CNT_FAM_MEMBERS'].value_counts()
#df['CNT_CHILDREN'].value_counts()

#Codigo para identificar o limite  em CNT_CHILDREN e CNT_FAM_MEMBERS

In [13]:
df['CNT_CHILDREN'] = df['CNT_CHILDREN'].clip(upper=6)
df['CNT_FAM_MEMBERS'] = df['CNT_FAM_MEMBERS'].clip(upper=7)

#Definindo um limite para quantidade de filhos e familiares aceitos, mais que isso é outlier.

In [14]:
df['amt_income_month'].describe(percentiles=[.99, .995, .999])

count    438557.000000
mean      15627.023840
std        9173.904423
min        2175.000000
50%       13398.380000
99%       45000.000000
99.5%     56250.000000
99.9%     82500.000000
max      562500.000000
Name: amt_income_month, dtype: float64

In [15]:
#amt_income_month foi transformada via log1p para reduzir cauda longa.
#renda_per_capita foi transformada via log1p para reduzir cauda longa.
df['amt_income_month'] = np.log1p(df['amt_income_month'])
df['renda_per_capita'] = np.log1p(df['renda_per_capita'])

#original = np.expm1(df['amt_income_month']) Caso deseje recuperar o dado original.
#original = np.expm1(df['renda_per_capita']) Caso deseje recuperar o dado original.

In [16]:
df.describe()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,CNT_FAM_MEMBERS,years,amt_income_month,renda_per_capita,years_employed,contact,target
count,4.385570e+05,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.000000,438557.0,438557.000000
mean,6.022176e+06,0.671384,0.371897,0.693351,0.427196,2.194221,43.295569,9.539283,8.837189,5.947989,1.0,0.254642
std,5.716370e+05,0.469711,0.483312,0.461103,0.722509,0.895038,11.459525,0.474904,0.630218,6.563699,0.0,0.435660
min,5.008804e+06,0.000000,0.000000,0.000000,0.000000,1.000000,20.000000,7.685244,6.152201,0.000000,1.0,0.000000
25%,5.609375e+06,0.000000,0.000000,0.000000,0.000000,2.000000,34.000000,9.222862,8.452868,1.020000,1.0,0.000000
50%,6.047745e+06,1.000000,0.000000,1.000000,0.000000,2.000000,42.000000,9.502964,8.789279,4.020000,1.0,0.000000
75%,6.456971e+06,1.000000,1.000000,1.000000,1.000000,3.000000,53.000000,9.839002,9.241209,8.500000,1.0,1.000000
max,7.999952e+06,1.000000,1.000000,1.000000,6.000000,7.000000,68.000000,13.240148,12.547003,48.000000,1.0,1.000000

In [17]:
clients_fe = df.drop(columns=['contact'], axis=1)

# 🧹 Data Cleaning — Projeto de Preparação de Dados

Este notebook descreve as etapas de **limpeza e transformação** aplicadas ao dataset, garantindo que os dados estejam prontos para análise exploratória e modelagem preditiva.

---

### 1️⃣ Tratamento de Variáveis Binárias

As colunas com valores categóricos binários foram transformadas em **0 e 1** para facilitar o entendimento do modelo:

```python
# Transformação Y=1, N=0
df['CODE_GENDER'] = df['CODE_GENDER'].map({'Y':1, 'N':0})
df['FLAG_OWN_CAR'] = df['FLAG_OWN_CAR'].map({'Y':1, 'N':0})
df['FLAG_OWN_REALTY'] = df['FLAG_OWN_REALTY'].map({'Y':1, 'N':0})
```
---

⚡ Benefício: Facilita a interpretação binária pelo modelo e reduz erros de codificação manual.

---

### 2️⃣ Tratamento de Valores Faltantes (NaNs)

Para lidar com valores ausentes, aplicamos preenchimento específico por coluna:
```python
# Limpeza dos dados nans nas colunas [OCCUPATION_TYPE, years_employed]
df['OCCUPATION_TYPE'] = df['OCCUPATION_TYPE'].fillna('Missing')
df['years_employed'] = df['years_employed'].fillna(0)
```
---

⚡ Benefício: Evita perda de registros importantes e mantém a consistência do dataset.

---

### 3️⃣ Conversão de Colunas Categóricas

Colunas do tipo object foram convertidas para categorical, facilitando a interpretação do modelo sem a necessidade de one-hot encoding:

```python
# Transformando colunas categóricas em tipo category
cat_cols = [
    "NAME_INCOME_TYPE",
    "NAME_EDUCATION_TYPE",
    "NAME_FAMILY_STATUS",
    "NAME_HOUSING_TYPE",
    "OCCUPATION_TYPE",
]
for col in cat_cols:
    df[col] = df[col].astype('category')
```
---

⚡ Benefício: Compatível com categóricas nativas do XGBoost (enable_categorical=True).

---

### 4️⃣ Tratamento de Outliers

Foram definidos limites máximos para variáveis relacionadas à composição familiar, considerando que valores maiores seriam outliers:

```python
df['CNT_CHILDREN'] = df['CNT_CHILDREN'].clip(upper=6)
df['CNT_FAM_MEMBERS'] = df['CNT_FAM_MEMBERS'].clip(upper=7)
```
---

⚡ Benefício: Reduz o impacto de valores extremos, evitando distorções em métricas estatísticas e na modelagem.

---

### 5️⃣ Transformação Logarítmica

Variáveis de renda com distribuição assimétrica foram transformadas usando log1p, que permite lidar com valores zero:

```python
df['amt_income_month'] = np.log1p(df['amt_income_month'])
df['renda_per_capita'] = np.log1p(df['renda_per_capita'])
```

---

⚡ Benefício: Reduz a assimetria da distribuição, evita dominância de valores extremos e melhora a estabilidade dos splits em modelos baseados em árvore, como XGBoost..

---
### 6️⃣ Remoção de Colunas Irrelevantes

Algumas colunas não agregavam informação relevante para a modelagem:

```python
clients_fe = df.drop(columns=['ID', 'contact'], axis=1)
```

---

⚡ Benefício: Reduz dimensionalidade e melhora desempenho computacional.

---

## 7️⃣ Resumo do Data Cleaning
Etapa	Status
Transformação binária	✅ CODE_GENDER, FLAG_OWN_CAR, FLAG_OWN_REALTY
Tratamento de NaNs	✅ OCCUPATION_TYPE = Missing, years_employed = 0
Conversão de categóricas	✅ Colunas object → category
Tratamento de outliers	✅ CNT_CHILDREN ≤ 6, CNT_FAM_MEMBERS ≤ 7
Transformação logarítmica	✅ amt_income_month, renda_per_capita
Remoção de colunas	✅ ID e contact

In [18]:
clients_fe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  int64
 2   FLAG_OWN_CAR         438557 non-null  int64
 3   FLAG_OWN_REALTY      438557 non-null  int64
 4   CNT_CHILDREN         438557 non-null  int64
 5   NAME_INCOME_TYPE     438557 non-null  category
 6   NAME_EDUCATION_TYPE  438557 non-null  category
 7   NAME_FAMILY_STATUS   438557 non-null  category
 8   NAME_HOUSING_TYPE    438557 non-null  category
 9   OCCUPATION_TYPE      438557 non-null  category
 10  CNT_FAM_MEMBERS      438557 non-null  float64
 11  years                438557 non-null  int64
 12  amt_income_month     438557 non-null  float64
 13  renda_per_capita     438557 non-null  float64
 14  years_employed       438557 non-null  float64
 15  target               438557 non-null  int64
dtypes: category(5), float64(4), int64(7)
memory usage: 38.9 MB

In [19]:
clients_fe.to_parquet('../data/credit/clients_fe.parquet', compression='snappy')
#Salvando em um novo parquet para feature engineering (salvado em parquet pois suporta variavel category)